Tangtiam/sdk-bsp-stm32h750-realthread-tpi/rt-thread/components/libraries/libdl_v2/dlmodule.c
    return RT_EOK;
}

static void _delete_subthread(rt_thread_t tid)
{
    struct rt_thread    *thread = RT_NULL;
    struct rt_list_node *list = RT_NULL;
    struct rt_dlmodule* module;

    module = tid->module;

    rt_enter_critical();

    /* delete all sub threads */
    while ((list = tid->sibling.prev) != &module->t_grp)
    {
        thread = rt_list_entry(list, struct rt_thread, sibling);
        /* stop timer */
        if ((thread->stat & RT_THREAD_STAT_MASK) != RT_THREAD_CLOSE &&
            (thread->stat & RT_THREAD_STAT_MASK) != RT_THREAD_INIT)
        {
            rt_timer_stop(&(thread->thread_timer));
        }
        rt_list_remove(&thread->sibling);
        rt_thread_control(thread, RT_THREAD_CTRL_CLOSE, RT_NULL);
    }

    rt_exit_critical();
}

#ifdef RT_USING_EXCEPTION_HANDLE
static rt_err_t _dlmodule_exception_handle(void *context)
{
    if (dlmodule_self())
    {
        /* close assertion module */
        dlmodule_exit(-1);
    }

    return RT_EOK;
}
#endif

static void _dlmodule_assert_hook(const char *ex, const char *func, rt_size_t line)
{
    volatile char dummy = 0;

    rt_kprintf("(%s) assertion failed at function:%s, line number:%d \n", ex, func, line);
    if (dlmodule_self())
    {
        /* close assertion module */
        dlmodule_exit(-1);
    }
    else
    {
        while (dummy == 0);
    }
}

void dlmodule_cleanup(struct rt_thread *tid)
{
    struct rt_dlmodule* module;

    RT_ASSERT(tid != RT_NULL);
    module = tid->module;
    RT_ASSERT(module != RT_NULL);

    if(tid == module->t_main && module->nref > 1)
    {
        _delete_subthread(tid);
    }
    else
    {
        rt_enter_critical();
        rt_list_remove(&tid->sibling);
        rt_exit_critical();
    }

    dlmodule_ref_dec(module);

#if RT_VER_NUM <= 0x50000
    LOG_I("cleanup thread: %s, stack_addr: %08X", tid->name, tid->stack_addr);
#else
    LOG_I("cleanup thread: %s, stack_addr: %08X", tid->parent.name, tid->stack_addr);
#endif

    return;
}

void dlmodule_add_subthread(struct rt_dlmodule* module, rt_thread_t thread)
{
    rt_base_t level;
    RT_ASSERT(module != RT_NULL);
    RT_ASSERT(thread != RT_NULL);

    level = rt_hw_interrupt_disable();
    rt_list_insert_after(&(module->t_grp), &(thread->sibling));
    rt_hw_interrupt_enable(level);    
}

int dlmodule_ref_inc(struct rt_dlmodule* module)
{
    rt_base_t level;
    RT_ASSERT(module != RT_NULL);

    level = rt_hw_interrupt_disable();
    module->nref++;
    rt_hw_interrupt_enable(level);

    return 0;
}

int dlmodule_ref_dec(struct rt_dlmodule* module)
{
    rt_base_t level;
    int ref = -1;
    RT_ASSERT(module != RT_NULL);

    level = rt_hw_interrupt_disable();
    if (module->nref)
    {
        module->nref--;
        ref = module->nref;
    }
    rt_hw_interrupt_enable(level);
    if (!ref)
    {
        dlmodule_free(module);

        return 0;
    }

    return -1;
}

struct rt_dlmodule *dlmodule_self(void)
{
    rt_thread_t tid;
    struct rt_dlmodule *ret = RT_NULL;

    tid = rt_thread_self();
    if (tid)
    {
        ret = tid->module;
    }

    return ret;
}

/*
 * Compatible with old API
 */
struct rt_dlmodule *rt_module_self(void)
{
    return dlmodule_self();
}

static rt_uint8_t _is_dlmodule_load(const char* path)
{
    int index = 0;
    struct rt_dlmodule *mid = RT_NULL;
    int size = 0;
    const char *first = RT_NULL, *end = RT_NULL, *ptr = RT_NULL;
    char name[RT_NAME_MAX] = {'\0'};

    ptr   = first = (char *)path;
    end   = path + rt_strlen(path);

    while (*ptr != '\0')
    {
        if (*ptr == '/')
            first = ptr + 1;
        if (*ptr == '.')
            end = ptr - 1;

        ptr ++;
    }

    size = end - first + 1;
    if (size > RT_NAME_MAX)
        size = RT_NAME_MAX;

    rt_strncpy(name, first, size);
    name[size] = '\0';
    
    for (index = 0; index < RT_MID_NUM_MAX; index++)
    {
        mid = mids.map[index];
        if (mid != RT_NULL)
        {
            if (rt_strcmp(mid->parent.name, name) == 0)
            {
                return 1;
            }
        }
    }

    return 0;
}

static int _module_name2mid(const char* name)
{
    int index = 0;
    rt_base_t level = 0;

    level = rt_hw_interrupt_disable();
    for (index = 0; index < RT_MID_NUM_MAX; index++)
    {
        if (mids.map[index])
        {
            if(!rt_strncmp(name, mids.map[index]->parent.name, RT_NAME_MAX))
            {
                rt_hw_interrupt_enable(level);
                return index;
            }
        }
    }

    rt_hw_interrupt_enable(level);
    return -1;
}

struct rt_dlmodule* dlmodule_load(const char* path)
{
#ifdef RT_USING_POSIX_FS
    int fd = -1, length = 0;
#endif
    rt_uint8_t i = 0;
    rt_base_t level;
    rt_err_t ret = RT_EOK;
    rt_uint8_t *module_ptr = RT_NULL;
    struct rt_dlmodule *module = RT_NULL;

    if(_is_dlmodule_load(path))
    {
        rt_kprintf("module [%s] has already been loaded!\n", path);

        //return RT_NULL;
    }

#ifdef RT_USING_POSIX_FS
    fd = open(path, O_RDONLY, 0);
    if (fd >= 0)
    {
        length = lseek(fd, 0, SEEK_END);
        lseek(fd, 0, SEEK_SET);

        if (length == 0) goto __exit;

        module_ptr = (uint8_t*) rt_malloc (length);
        if (!module_ptr) goto __exit;

        if (read(fd, module_ptr, length) != length)
            goto __exit;

        /* close file and release fd */
        close(fd);
        fd = -1;
    }
    else
    {
        goto __exit;
    }
#endif

    if (!module_ptr) goto __exit;

    /* check ELF header */
    if (rt_memcmp(elf_module->e_ident, RTMMAG, SELFMAG) != 0 &&
        rt_memcmp(elf_module->e_ident, ELFMAG, SELFMAG) != 0)
    {
        rt_kprintf("Module: magic error\n");
        goto __exit;
    }

    /* check ELF class */
    if ((elf_module->e_ident[EI_CLASS] != ELFCLASS32)&&(elf_module->e_ident[EI_CLASS] != ELFCLASS64))
    {
        rt_kprintf("Module: ELF class error\n");
        goto __exit;
    }

    module = dlmodule_new();
    if (!module) goto __exit;

    /* set the name of module */
    _dlmodule_set_name(module, path);

    LOG_D("rt_module_load: %.*s", RT_NAME_MAX, module->parent.name);

    if (elf_module->e_type == ET_REL)
    {
        ret = dlmodule_load_relocated_object(module, module_ptr);
    }
    else if (elf_module->e_type == ET_DYN)
    {
        ret = dlmodule_load_shared_object(module, module_ptr);
    }
    else
    {
        rt_kprintf("Module: unsupported elf type\n");
        goto __exit;
    }

    /* check return value */
    if (ret != RT_EOK) goto __exit;

    /* release module data */
    rt_free(module_ptr);

    /* set module initialization and cleanup function */
    module->init_func = dlsym(module, "module_init");
    module->cleanup_func = dlsym(module, "module_cleanup");
    /* do module initialization */
    if (module->init_func)
    {
        module->init_func(module);
    }

    level = rt_hw_interrupt_disable();
    for (i = mids.last; i < RT_MID_NUM_MAX; i++)
    {
        if (!mids.map[i])
        {
            break;
        }
    }

    if (i >= RT_MID_NUM_MAX)
    {
        for (i = 0; i < mids.last; i++)
        {
            if (!mids.map[i])
            {
                break;
            }
        }
    }

