Tangtiam/sdk-bsp-stm32h750-realthread-tpi/rt-thread/components/libraries/libdl_v2/dlmodule.c
    mids.last = (i + 1) % RT_MID_NUM_MAX;
    module->mid = i;
    mids.map[i] = module;
    rt_hw_interrupt_enable(level);
    
    return module;

__exit:
#ifdef RT_USING_POSIX_FS
    if (fd >= 0) close(fd);
#endif
    if (module_ptr) rt_free(module_ptr);
    if (module) dlmodule_free(module);

    return RT_NULL;
}

rt_err_t dlmoudle_run(struct rt_dlmodule* module)
{
    rt_thread_t tid;
    rt_err_t ret = RT_EOK;

    RT_ASSERT(module != RT_NULL);

    /* check stack size and priority */
    if (module->priority > RT_THREAD_PRIORITY_MAX) module->priority = RT_THREAD_PRIORITY_MAX - 1;
    if (module->stack_size < 2048 || module->stack_size > (1024 * 32)) module->stack_size = 2048;

    tid = rt_thread_create(module->parent.name, _dlmodule_thread_entry, (void*)module,
        module->stack_size, module->priority, 10);
    if (tid)
    {
        tid->module = module;
        module->t_main = tid;
        rt_list_init(&(tid->sibling));
        dlmodule_add_subthread(module, tid); 
        dlmodule_ref_inc(module);

        /* install thread cleanup handler */
        tid->cleanup = dlmodule_cleanup;

#ifdef RT_USING_EXCEPTION_HANDLE
        /* install exception handler */
        rt_hw_exception_install(_dlmodule_exception_handle);
#endif
        /* install assert hook hander */
#ifdef RT_DEBUG
         rt_assert_set_hook(_dlmodule_assert_hook);
#endif

        rt_thread_startup(tid);
    }
    else
    {
        /* destory dl module */
        dlmodule_free(module);
        module = RT_NULL;
        ret = -RT_ERROR;
    }

    return ret;
}

struct rt_dlmodule* dlmodule_exec(const char* pgname, int debug, const char* cmd, int length)
{
    struct rt_dlmodule *module;

    module = dlmodule_load(pgname);
    if (module && module->entry)
    {
        if (debug)
        {
            module->debug = debug;
        }
        module->cmd_line = rt_strdup(cmd);
        dlmoudle_run(module);
    }

    return module;
}

static void _cmd_load(const char *path)
{
    struct rt_dlmodule *module = RT_NULL;

    module = dlmodule_load(path);
    if (module)
    {
        load_address = module->mem_space;
        rt_kprintf("entry addr[0x%p]\n", module->entry);
    }
    else
    {
        rt_kprintf("load module failed!\n");
    }
}

static void _cmd_run(const char *name)
{
    struct rt_dlmodule *module = RT_NULL;
    int mid = 0;

    mid = _module_name2mid(name);
    if (mid < 0)
    {
        rt_kprintf("can't find [%s] module\n", name);
        return;
    }

    module = mids.map[mid];
    if (module->entry)
    {
        module->debug = 0;
        module->cmd_line = rt_strdup(name);
        dlmoudle_run(module);
    }
}

static void _cmd_remove(const char *name)
{
    struct rt_dlmodule *module = RT_NULL;
    int mid = 0;

    mid = _module_name2mid(name);
    if (mid < 0)
    {
        rt_kprintf("can't find [%s] module\n", name);
        return;
    }

    module = mids.map[mid];
    if (module)
    {
        dlmodule_delete(module);
    }
}

int app(int argc, char **argv)
{
    const char *operator = argv[1];
    if(argc == 3)
    {
        if (!rt_strcmp(operator, "load"))
        {
            _cmd_load(argv[2]);
        }
        else if(!rt_strcmp(operator, "kill"))
        {
            _cmd_remove(argv[2]);
        }
        else if(!rt_strcmp(operator, "run"))
        {
            _cmd_run(argv[2]);
        }
        else
        {
            goto _app_usage;
        }
        
        return 0;
    }

_app_usage:
    rt_kprintf("Usage: app [options] [app_name]\n");
    rt_kprintf("[options]:\n");
    rt_kprintf("    load - Load app\n");
    rt_kprintf("    run - Run app\n");
    rt_kprintf("    kill - Remove app\n");

    return 0;
}
MSH_CMD_EXPORT(app, app(module) debug commond);

void dlmodule_delete(struct rt_dlmodule *module)
{
    RT_ASSERT(module != RT_NULL);

    if(module->t_main == RT_NULL)
    {
        dlmodule_free(module);
        module = RT_NULL;
    }
    else
    {
        /* delete thread: insert to defunct thread list */
        rt_thread_control(module->t_main, RT_THREAD_CTRL_CLOSE, RT_NULL);
    }
}

void dlmodule_exit(int value)
{
    struct rt_dlmodule *module;
    rt_thread_t tid;

    tid = rt_thread_self();
    module = tid->module;
    if(!module)
    {
        LOG_E("dlmodule_exit: module null\n");
        return;
    }

    module->ret_code = value;
    dlmodule_delete(module);

    if(tid != module->t_main)
    {
        rt_thread_suspend(tid);
        rt_schedule();
    }
}

rt_uint32_t dlmodule_symbol_find(const char *sym_str)
{
    /* find in kernel symbol table */
    struct rt_module_symtab *index;

    for (index = _rt_module_symtab_begin; index != _rt_module_symtab_end; index ++)
    {
        if (rt_strcmp(index->name, sym_str) == 0)
            return (rt_uint32_t)index->addr;
    }

    return 0;
}

int rt_system_dlmodule_init(void)
{
#if defined(__GNUC__) && !defined(__CC_ARM)
    extern int __rtmsymtab_start;
    extern int __rtmsymtab_end;

    _rt_module_symtab_begin = (struct rt_module_symtab *)&__rtmsymtab_start;
    _rt_module_symtab_end   = (struct rt_module_symtab *)&__rtmsymtab_end;
#elif defined (__CC_ARM)
    extern int RTMSymTab$$Base;
    extern int RTMSymTab$$Limit;

    _rt_module_symtab_begin = (struct rt_module_symtab *)&RTMSymTab$$Base;
    _rt_module_symtab_end   = (struct rt_module_symtab *)&RTMSymTab$$Limit;
#elif defined (__IAR_SYSTEMS_ICC__)
    _rt_module_symtab_begin = __section_begin("RTMSymTab");
    _rt_module_symtab_end   = __section_end("RTMSymTab");
#endif

    rt_memset(mids.map, RT_NULL, RT_MID_NUM_MAX * sizeof(struct rt_dlmodule*));
    mids.last = 0;

    return 0;
}
INIT_COMPONENT_EXPORT(rt_system_dlmodule_init);

/**
 * This function will find the specified module.
 *
 * @param name the name of module finding
 *
 * @return the module
 */
struct rt_dlmodule *dlmodule_find(const char *name)
{
    rt_object_t object;
    struct rt_dlmodule *ret = RT_NULL;

    object = rt_object_find(name, RT_Object_Class_Module);
    if (object)
    {
        ret = (struct rt_dlmodule*) object;
    }

    return ret;
}
RTM_EXPORT(dlmodule_find);

#ifdef RT_USING_FINSH

int list_symbols(void)
{
    extern int __rtmsymtab_start;
    extern int __rtmsymtab_end;

