Tangtiam/sdk-bsp-stm32h750-realthread-tpi/rt-thread/components/libraries/libdl_v2/dlmodule.c
    /* find in kernel symbol table */
    struct rt_module_symtab *index;

    for (index = _rt_module_symtab_begin;
         index != _rt_module_symtab_end;
         index ++)
    {
        rt_kprintf("%s => 0x%08x\n", index->name, index->addr);
    }

    return 0;
}
MSH_CMD_EXPORT(list_symbols, list symbols information);

/* copy from components/finsh/cmd.c */
static void object_split(int len)
{
    while (len--)
    {
        rt_kprintf("-");
    }
}

static void print_thread_info(struct rt_thread* thread, int maxlen)
{
    rt_uint8_t *ptr;
    rt_uint8_t stat;

#ifdef RT_USING_SMP
    if (thread->oncpu != RT_CPU_DETACHED)
        rt_kprintf("%-*.*s %3d %3d ", maxlen, RT_NAME_MAX, thread->parent.name, thread->oncpu, thread->current_priority);
    else
        rt_kprintf("%-*.*s N/A %3d ", maxlen, RT_NAME_MAX, thread->parent.name, thread->current_priority);
#elif RT_VER_NUM <= 0x50000
    rt_kprintf("%-*.*s %3d ", maxlen, RT_NAME_MAX, thread->name, thread->current_priority);
#else
    rt_kprintf("%-*.*s %3d ", maxlen, RT_NAME_MAX, thread->parent.name, thread->current_priority);
#endif /*RT_USING_SMP*/

    stat = (thread->stat & RT_THREAD_STAT_MASK);
    if (stat == RT_THREAD_READY)        rt_kprintf(" ready  ");
#if RT_VER_NUM <= 0x50000
    else if (stat == RT_THREAD_SUSPEND) rt_kprintf(" suspend");
#else
    else if ((stat & RT_THREAD_SUSPEND_MASK) == RT_THREAD_SUSPEND_MASK) rt_kprintf(" suspend");
#endif
    else if (stat == RT_THREAD_INIT)    rt_kprintf(" init   ");
    else if (stat == RT_THREAD_CLOSE)   rt_kprintf(" close  ");
    else if (stat == RT_THREAD_RUNNING) rt_kprintf(" running");

#if defined(ARCH_CPU_STACK_GROWS_UPWARD)
    ptr = (rt_uint8_t *)thread->stack_addr + thread->stack_size;
    while (*ptr == '#')ptr--;

    rt_kprintf(" 0x%08x 0x%08x    %02d%%   0x%08x %03d\n",
            ((rt_uint32_t)thread->sp - (rt_uint32_t)thread->stack_addr),
            thread->stack_size,
            ((rt_uint32_t)ptr - (rt_uint32_t)thread->stack_addr) * 100 / thread->stack_size,
            thread->remaining_tick,
            thread->error);
#else
    ptr = (rt_uint8_t *)thread->stack_addr;
    while (*ptr == '#')ptr++;

    rt_kprintf(" 0x%08x 0x%08x    %02d%%   0x%08x %03d\n",
            (thread->stack_size + (rt_uint32_t)(rt_size_t)thread->stack_addr - (rt_uint32_t)(rt_size_t)thread->sp),
            thread->stack_size,
            (thread->stack_size + (rt_uint32_t)(rt_size_t)thread->stack_addr - (rt_uint32_t)(rt_size_t)ptr) * 100
            / thread->stack_size,
            thread->remaining_tick,
            thread->error);
#endif
}

int list_module(void)
{
    struct rt_dlmodule *module;
    struct rt_list_node *list, *node;
    struct rt_object_information *info;
    const char *item_title = "thread";
    int maxlen;

    info = rt_object_get_information(RT_Object_Class_Module);
    list = &info->object_list;
    maxlen = RT_NAME_MAX;

    rt_kprintf("%-*.s %-*.s %-*.s pri  status      sp     stack size max used left tick  error\n", 4, "ID", maxlen, "module", maxlen, item_title);
        object_split(4);rt_kprintf(" ");object_split(maxlen);rt_kprintf(" ");object_split(maxlen);rt_kprintf(" ");
        rt_kprintf(                  "---  ------- ---------- ----------  ------  ---------- ---\n");
    for (node = list->next; node != list; node = node->next)
    {
        struct rt_thread    *thread = RT_NULL;
        struct rt_list_node *n = RT_NULL;

        module = (struct rt_dlmodule *)(rt_list_entry(node, struct rt_object, list));

        for (n = module->t_grp.next; n != &module->t_grp; n = n->next)
        {
            thread = rt_list_entry(n, struct rt_thread, sibling);

            rt_kprintf("%4d %-*.*s ", 0 , maxlen, RT_NAME_MAX, module->parent.name);
            print_thread_info(thread, maxlen);
        }
    }

    return 0;
}
MSH_CMD_EXPORT(list_module, list modules in system);

int kill(int argc, char **argv)
{
    struct rt_dlmodule *module = RT_NULL;

    module = dlmodule_find(argv[1]);
    if(module != RT_NULL)
    {
        dlmodule_delete(module);
    }
    else
    {
        rt_kprintf("Can't find module %s\n", argv[1]);
    }

    return 0;
}
MSH_CMD_EXPORT(kill, delete modules in system);

#endif
